{
  "translation": {
    "site-title": "Stock Tracker",
    "password": "password",
    "hello": "Hello",
    "name": "name",
    "update": "update",
    "recover": "recover",
    "back": "return",
    "register": "register",
    "search": "search",
    "buy": "Buy",
    "sell": "Sell",
    "cancel": "Cancel",
    "value": "value",
    "bought": "bought",
    "price": "Price",
    "qnt": "Quantity",

    "sell-info-title": "Sell informations",
    "sell-price": "Price to be sold",
    "sell-earnings": "Earnings",
    "sell-date": "Sell date",
    "sell-value": "Sell price",
    "bougth-value": "Bought price (corrected)",
    "taxes": "Taxes",
    "profit": "Profit",
    "profit-percentage": "Profit percentage",

    "bought-date": "Bought date",
    "current-value": "current value",
    "forgot-password": "Forgot Password",
    "serach-stock": "Search stock",

    "register-title": "Register new account",
    "register-stock-title": "Register new stock",
    "register-nickname": "nickname",
    "register-stock": "Register stock",

    "stock-list": "Look a stock list (ibovespa)",
    "stock-select": "Select stock",
    "stock-name": "Stock name",
    "stock-symbol": "Stock symbol",

    "search-stock": "Search stock",
    "confirm-password": "confirm your password",
    "delete-account": "delete account",
    "qnt-buy": "Quantity to buy",
    "update-title": "Update your account data",

    "symbol-not-found-title": "Symbol not found",
    "symbol-not-found-text": "You can look at the link to see a list with symbols of available actions or try again with another symbol.",

    "no-stock-card-title-one": "It seems like you don't have simulations yet.",
    "no-stock-card-text-one": "To make a new simulation, search for a stock by its symbol in the search bar above. If you don't know the symbol, click on the link 'View list of stocks (Ibovespa)' to see a list of available stocks.",
    "no-stock-card-title-two": "About the website",
    "no-stock-card-text-two": "The Stock Monitor is a website that allows you to interact with stocks from the stock market by conducting simulations or real registrations.",
    "no-stock-card-text-three": "When choosing an asset through the link 'View list of stocks (Ibovespa)', you'll have the option to conduct a simulation or register the stock (which can be real) in your portfolio on the website. Upon conducting the sale, the website will display a card with information about the profitability of the stock, performing calculations to show relevant selling information to the investor without them having to do it themselves.",
    "simulation": "Simulation",
    "simulation-text-one": "Simulation is a way for you to track the performance of a stock without needing to invest real money.",
    "simulation-text-two": "To conduct a simulation, search for the stock symbol in the search bar and click on 'Buy'. Upon doing so, a prompt will appear asking you to enter the quantity of shares you wish to buy. After entering the quantity, click 'Buy' again and the simulation will be conducted.",
    "simulation-text-three": "To conduct the sale, click on 'Sell'. The platform will show a card with information about the profitability of the simulation. This card takes into consideration values that the user won't be able to control, such as the purchase and sale dates, sale and purchase prices, and earnings. After that, if the user is satisfied with the simulation, simply click 'Sell' again and you're done.",
    "simulation-text-four": "This is the quickest type of interaction with the website and doesn't require the user to input more information to monitor the stock. However, the purchase and sale dates, purchase and sale prices, and earnings will be automatically generated values, meaning they are outside the user's control.",
    "simulation-text-five": "This is an alternative for those who want to 'play investing' using real stocks through the platform.",
    "reg-title": "Register",
    "register-text-one": "Registration is a way for you to add real stocks to your portfolio on the website.",
    "register-text-two": "To register a stock, there are two ways: search for the stock symbol in the search bar and click on 'Register', or you can click on 'Register stock' (The second way is only available on computers).",
    "register-text-three": "Upon doing so, a prompt will appear asking you to enter the stock name, symbol, quantity, price, and the day the stock was purchased. These values will already be filled in if the stock is registered from a search through the search bar, but they can be changed (if the user modifies the name and symbol of the stock, the process of automatically fetching the data may be compromised). After entering the values, click on Register and the stock will be registered.",
    "register-text-four": "To conduct the sale, click on Sell. The platform will show a card that prompts the user to complete some information about the sale so that profitability information can be calculated more accurately. After entering the values, click on Sell, and a card will appear with information just like the simulations, but with values provided by the user.",
    "register-text-five": "This is the most comprehensive type of interaction with the website and requires the user to input more information to monitor the stock. It can also be used for 'play investing', but it can be used as a registrar of real stocks, providing the user with real information about stocks they own in their portfolio. It can be used as a real stock monitoring tool."
  }
}
